external/followit.se/Login.xml_dist

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <Login xmlns="http://tempuri.org/">
      <login></login>
      <password></password>
    </Login>
  </soap:Body>
</soap:Envelope>
